Hardnet 68 LOADING
Hardnet 68 LOADED READY
=> WARN: SpatialCGNL block uses '8' groups yellow
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 176, 176]             864
       BatchNorm2d-2         [-1, 32, 176, 176]              64
             ReLU6-3         [-1, 32, 176, 176]               0
            Conv2d-4         [-1, 64, 176, 176]          18,432
       BatchNorm2d-5         [-1, 64, 176, 176]             128
             ReLU6-6         [-1, 64, 176, 176]               0
         MaxPool2d-7           [-1, 64, 88, 88]               0
            Conv2d-8           [-1, 14, 88, 88]           8,064
       BatchNorm2d-9           [-1, 14, 88, 88]              28
            ReLU6-10           [-1, 14, 88, 88]               0
           Conv2d-11           [-1, 24, 88, 88]          16,848
      BatchNorm2d-12           [-1, 24, 88, 88]              48
            ReLU6-13           [-1, 24, 88, 88]               0
           Conv2d-14           [-1, 14, 88, 88]           3,024
      BatchNorm2d-15           [-1, 14, 88, 88]              28
            ReLU6-16           [-1, 14, 88, 88]               0
           Conv2d-17           [-1, 40, 88, 88]          36,720
      BatchNorm2d-18           [-1, 40, 88, 88]              80
            ReLU6-19           [-1, 40, 88, 88]               0
           Conv2d-20           [-1, 14, 88, 88]           5,040
      BatchNorm2d-21           [-1, 14, 88, 88]              28
            ReLU6-22           [-1, 14, 88, 88]               0
           Conv2d-23           [-1, 24, 88, 88]          11,664
      BatchNorm2d-24           [-1, 24, 88, 88]              48
            ReLU6-25           [-1, 24, 88, 88]               0
           Conv2d-26           [-1, 14, 88, 88]           3,024
      BatchNorm2d-27           [-1, 14, 88, 88]              28
            ReLU6-28           [-1, 14, 88, 88]               0
           Conv2d-29           [-1, 68, 88, 88]          86,904
      BatchNorm2d-30           [-1, 68, 88, 88]             136
            ReLU6-31           [-1, 68, 88, 88]               0
        HarDBlock-32          [-1, 124, 88, 88]               0
           Conv2d-33          [-1, 128, 88, 88]          15,872
      BatchNorm2d-34          [-1, 128, 88, 88]             256
            ReLU6-35          [-1, 128, 88, 88]               0
        MaxPool2d-36          [-1, 128, 44, 44]               0
           Conv2d-37           [-1, 16, 44, 44]          18,432
      BatchNorm2d-38           [-1, 16, 44, 44]              32
            ReLU6-39           [-1, 16, 44, 44]               0
           Conv2d-40           [-1, 28, 44, 44]          36,288
      BatchNorm2d-41           [-1, 28, 44, 44]              56
            ReLU6-42           [-1, 28, 44, 44]               0
           Conv2d-43           [-1, 16, 44, 44]           4,032
      BatchNorm2d-44           [-1, 16, 44, 44]              32
            ReLU6-45           [-1, 16, 44, 44]               0
           Conv2d-46           [-1, 46, 44, 44]          71,208
      BatchNorm2d-47           [-1, 46, 44, 44]              92
            ReLU6-48           [-1, 46, 44, 44]               0
           Conv2d-49           [-1, 16, 44, 44]           6,624
      BatchNorm2d-50           [-1, 16, 44, 44]              32
            ReLU6-51           [-1, 16, 44, 44]               0
           Conv2d-52           [-1, 28, 44, 44]          15,624
      BatchNorm2d-53           [-1, 28, 44, 44]              56
            ReLU6-54           [-1, 28, 44, 44]               0
           Conv2d-55           [-1, 16, 44, 44]           4,032
      BatchNorm2d-56           [-1, 16, 44, 44]              32
            ReLU6-57           [-1, 16, 44, 44]               0
           Conv2d-58           [-1, 78, 44, 44]         153,036
      BatchNorm2d-59           [-1, 78, 44, 44]             156
            ReLU6-60           [-1, 78, 44, 44]               0
           Conv2d-61           [-1, 16, 44, 44]          11,232
      BatchNorm2d-62           [-1, 16, 44, 44]              32
            ReLU6-63           [-1, 16, 44, 44]               0
           Conv2d-64           [-1, 28, 44, 44]          23,688
      BatchNorm2d-65           [-1, 28, 44, 44]              56
            ReLU6-66           [-1, 28, 44, 44]               0
           Conv2d-67           [-1, 16, 44, 44]           4,032
      BatchNorm2d-68           [-1, 16, 44, 44]              32
            ReLU6-69           [-1, 16, 44, 44]               0
           Conv2d-70           [-1, 46, 44, 44]          50,508
      BatchNorm2d-71           [-1, 46, 44, 44]              92
            ReLU6-72           [-1, 46, 44, 44]               0
           Conv2d-73           [-1, 16, 44, 44]           6,624
      BatchNorm2d-74           [-1, 16, 44, 44]              32
            ReLU6-75           [-1, 16, 44, 44]               0
           Conv2d-76           [-1, 28, 44, 44]          15,624
      BatchNorm2d-77           [-1, 28, 44, 44]              56
            ReLU6-78           [-1, 28, 44, 44]               0
           Conv2d-79           [-1, 16, 44, 44]           4,032
      BatchNorm2d-80           [-1, 16, 44, 44]              32
            ReLU6-81           [-1, 16, 44, 44]               0
           Conv2d-82          [-1, 134, 44, 44]         356,976
      BatchNorm2d-83          [-1, 134, 44, 44]             268
            ReLU6-84          [-1, 134, 44, 44]               0
        HarDBlock-85          [-1, 262, 44, 44]               0
           Conv2d-86          [-1, 256, 44, 44]          67,072
      BatchNorm2d-87          [-1, 256, 44, 44]             512
            ReLU6-88          [-1, 256, 44, 44]               0
           Conv2d-89           [-1, 20, 44, 44]          46,080
      BatchNorm2d-90           [-1, 20, 44, 44]              40
            ReLU6-91           [-1, 20, 44, 44]               0
           Conv2d-92           [-1, 34, 44, 44]          84,456
      BatchNorm2d-93           [-1, 34, 44, 44]              68
            ReLU6-94           [-1, 34, 44, 44]               0
           Conv2d-95           [-1, 20, 44, 44]           6,120
      BatchNorm2d-96           [-1, 20, 44, 44]              40
            ReLU6-97           [-1, 20, 44, 44]               0
           Conv2d-98           [-1, 58, 44, 44]         161,820
      BatchNorm2d-99           [-1, 58, 44, 44]             116
           ReLU6-100           [-1, 58, 44, 44]               0
          Conv2d-101           [-1, 20, 44, 44]          10,440
     BatchNorm2d-102           [-1, 20, 44, 44]              40
           ReLU6-103           [-1, 20, 44, 44]               0
          Conv2d-104           [-1, 34, 44, 44]          23,868
     BatchNorm2d-105           [-1, 34, 44, 44]              68
           ReLU6-106           [-1, 34, 44, 44]               0
          Conv2d-107           [-1, 20, 44, 44]           6,120
     BatchNorm2d-108           [-1, 20, 44, 44]              40
           ReLU6-109           [-1, 20, 44, 44]               0
          Conv2d-110           [-1, 98, 44, 44]         324,576
     BatchNorm2d-111           [-1, 98, 44, 44]             196
           ReLU6-112           [-1, 98, 44, 44]               0
          Conv2d-113           [-1, 20, 44, 44]          17,640
     BatchNorm2d-114           [-1, 20, 44, 44]              40
           ReLU6-115           [-1, 20, 44, 44]               0
          Conv2d-116           [-1, 34, 44, 44]          36,108
     BatchNorm2d-117           [-1, 34, 44, 44]              68
           ReLU6-118           [-1, 34, 44, 44]               0
          Conv2d-119           [-1, 20, 44, 44]           6,120
     BatchNorm2d-120           [-1, 20, 44, 44]              40
           ReLU6-121           [-1, 20, 44, 44]               0
          Conv2d-122           [-1, 58, 44, 44]          79,344
     BatchNorm2d-123           [-1, 58, 44, 44]             116
           ReLU6-124           [-1, 58, 44, 44]               0
          Conv2d-125           [-1, 20, 44, 44]          10,440
     BatchNorm2d-126           [-1, 20, 44, 44]              40
           ReLU6-127           [-1, 20, 44, 44]               0
          Conv2d-128           [-1, 34, 44, 44]          23,868
     BatchNorm2d-129           [-1, 34, 44, 44]              68
           ReLU6-130           [-1, 34, 44, 44]               0
          Conv2d-131           [-1, 20, 44, 44]           6,120
     BatchNorm2d-132           [-1, 20, 44, 44]              40
           ReLU6-133           [-1, 20, 44, 44]               0
          Conv2d-134          [-1, 168, 44, 44]         704,592
     BatchNorm2d-135          [-1, 168, 44, 44]             336
           ReLU6-136          [-1, 168, 44, 44]               0
       HarDBlock-137          [-1, 328, 44, 44]               0
          Conv2d-138          [-1, 320, 44, 44]         104,960
     BatchNorm2d-139          [-1, 320, 44, 44]             640
           ReLU6-140          [-1, 320, 44, 44]               0
       MaxPool2d-141          [-1, 320, 22, 22]               0
          Conv2d-142           [-1, 40, 22, 22]         115,200
     BatchNorm2d-143           [-1, 40, 22, 22]              80
           ReLU6-144           [-1, 40, 22, 22]               0
          Conv2d-145           [-1, 68, 22, 22]         220,320
     BatchNorm2d-146           [-1, 68, 22, 22]             136
           ReLU6-147           [-1, 68, 22, 22]               0
          Conv2d-148           [-1, 40, 22, 22]          24,480
     BatchNorm2d-149           [-1, 40, 22, 22]              80
           ReLU6-150           [-1, 40, 22, 22]               0
          Conv2d-151          [-1, 116, 22, 22]         446,832
     BatchNorm2d-152          [-1, 116, 22, 22]             232
           ReLU6-153          [-1, 116, 22, 22]               0
          Conv2d-154           [-1, 40, 22, 22]          41,760
     BatchNorm2d-155           [-1, 40, 22, 22]              80
           ReLU6-156           [-1, 40, 22, 22]               0
          Conv2d-157           [-1, 68, 22, 22]          95,472
     BatchNorm2d-158           [-1, 68, 22, 22]             136
           ReLU6-159           [-1, 68, 22, 22]               0
          Conv2d-160           [-1, 40, 22, 22]          24,480
     BatchNorm2d-161           [-1, 40, 22, 22]              80
           ReLU6-162           [-1, 40, 22, 22]               0
          Conv2d-163          [-1, 196, 22, 22]         959,616
     BatchNorm2d-164          [-1, 196, 22, 22]             392
           ReLU6-165          [-1, 196, 22, 22]               0
          Conv2d-166           [-1, 40, 22, 22]          70,560
     BatchNorm2d-167           [-1, 40, 22, 22]              80
           ReLU6-168           [-1, 40, 22, 22]               0
          Conv2d-169           [-1, 68, 22, 22]         144,432
     BatchNorm2d-170           [-1, 68, 22, 22]             136
           ReLU6-171           [-1, 68, 22, 22]               0
          Conv2d-172           [-1, 40, 22, 22]          24,480
     BatchNorm2d-173           [-1, 40, 22, 22]              80
           ReLU6-174           [-1, 40, 22, 22]               0
          Conv2d-175          [-1, 116, 22, 22]         317,376
     BatchNorm2d-176          [-1, 116, 22, 22]             232
           ReLU6-177          [-1, 116, 22, 22]               0
          Conv2d-178           [-1, 40, 22, 22]          41,760
     BatchNorm2d-179           [-1, 40, 22, 22]              80
           ReLU6-180           [-1, 40, 22, 22]               0
          Conv2d-181           [-1, 68, 22, 22]          95,472
     BatchNorm2d-182           [-1, 68, 22, 22]             136
           ReLU6-183           [-1, 68, 22, 22]               0
          Conv2d-184           [-1, 40, 22, 22]          24,480
     BatchNorm2d-185           [-1, 40, 22, 22]              80
           ReLU6-186           [-1, 40, 22, 22]               0
          Conv2d-187          [-1, 334, 22, 22]       2,224,440
     BatchNorm2d-188          [-1, 334, 22, 22]             668
           ReLU6-189          [-1, 334, 22, 22]               0
       HarDBlock-190          [-1, 654, 22, 22]               0
          Conv2d-191          [-1, 640, 22, 22]         418,560
     BatchNorm2d-192          [-1, 640, 22, 22]           1,280
           ReLU6-193          [-1, 640, 22, 22]               0
       MaxPool2d-194          [-1, 640, 11, 11]               0
          Conv2d-195          [-1, 160, 11, 11]         921,600
     BatchNorm2d-196          [-1, 160, 11, 11]             320
           ReLU6-197          [-1, 160, 11, 11]               0
          Conv2d-198          [-1, 272, 11, 11]       1,958,400
     BatchNorm2d-199          [-1, 272, 11, 11]             544
           ReLU6-200          [-1, 272, 11, 11]               0
          Conv2d-201          [-1, 160, 11, 11]         391,680
     BatchNorm2d-202          [-1, 160, 11, 11]             320
           ReLU6-203          [-1, 160, 11, 11]               0
          Conv2d-204          [-1, 462, 11, 11]       4,457,376
     BatchNorm2d-205          [-1, 462, 11, 11]             924
           ReLU6-206          [-1, 462, 11, 11]               0
       HarDBlock-207          [-1, 782, 11, 11]               0
          Conv2d-208         [-1, 1024, 11, 11]         800,768
     BatchNorm2d-209         [-1, 1024, 11, 11]           2,048
           ReLU6-210         [-1, 1024, 11, 11]               0
         HarDNet-211  [[-1, 128, 88, 88], [-1, 320, 44, 44], [-1, 640, 22, 22], [-1, 1024, 11, 11]]               0
          Conv2d-212          [-1, 256, 11, 11]       2,359,296
     BatchNorm2d-213          [-1, 256, 11, 11]             512
            ReLU-214          [-1, 256, 11, 11]               0
          Conv2d-215          [-1, 128, 11, 11]          32,768
          Conv2d-216          [-1, 128, 11, 11]          32,768
          Conv2d-217          [-1, 128, 11, 11]          32,768
          Conv2d-218          [-1, 256, 11, 11]           4,096
       GroupNorm-219          [-1, 256, 11, 11]             512
     SpatialCGNL-220          [-1, 256, 11, 11]               0
          Conv2d-221            [-1, 256, 5, 5]           2,560
     BatchNorm2d-222            [-1, 256, 5, 5]             512
            ReLU-223            [-1, 256, 5, 5]               0
          Conv2d-224            [-1, 256, 2, 2]           2,560
     BatchNorm2d-225            [-1, 256, 2, 2]             512
            ReLU-226            [-1, 256, 2, 2]               0
         Sigmoid-227          [-1, 256, 11, 11]               0
LocalAttenModule-228          [-1, 256, 11, 11]               0
          Conv2d-229            [-1, 256, 5, 5]           2,560
     BatchNorm2d-230            [-1, 256, 5, 5]             512
            ReLU-231            [-1, 256, 5, 5]               0
          Conv2d-232            [-1, 256, 2, 2]           2,560
     BatchNorm2d-233            [-1, 256, 2, 2]             512
            ReLU-234            [-1, 256, 2, 2]               0
         Sigmoid-235          [-1, 256, 11, 11]               0
LocalAttenModule-236          [-1, 256, 11, 11]               0
          Conv2d-237            [-1, 256, 5, 5]           2,560
     BatchNorm2d-238            [-1, 256, 5, 5]             512
            ReLU-239            [-1, 256, 5, 5]               0
          Conv2d-240            [-1, 256, 2, 2]           2,560
     BatchNorm2d-241            [-1, 256, 2, 2]             512
            ReLU-242            [-1, 256, 2, 2]               0
         Sigmoid-243          [-1, 256, 11, 11]               0
LocalAttenModule-244          [-1, 256, 11, 11]               0
          Conv2d-245          [-1, 256, 11, 11]       2,359,552
     BatchNorm2d-246          [-1, 256, 11, 11]             512
          Conv2d-247          [-1, 512, 11, 11]       4,719,104
              SA-248          [-1, 256, 11, 11]               0
          Conv2d-249          [-1, 256, 11, 11]          65,792
     BatchNorm2d-250          [-1, 256, 11, 11]             512
          Conv2d-251            [-1, 256, 1, 1]         262,400
          Conv2d-252            [-1, 256, 1, 1]          65,792
              CA-253          [-1, 256, 11, 11]               0
          Conv2d-254          [-1, 256, 22, 22]       1,474,816
     BatchNorm2d-255          [-1, 256, 22, 22]             512
          Conv2d-256          [-1, 256, 11, 11]         590,080
     BatchNorm2d-257          [-1, 256, 11, 11]             512
          Conv2d-258          [-1, 256, 11, 11]         590,080
     BatchNorm2d-259          [-1, 256, 11, 11]             512
          Conv2d-260          [-1, 256, 11, 11]         590,080
          Conv2d-261          [-1, 256, 22, 22]         590,080
          Conv2d-262          [-1, 256, 11, 11]         590,080
          Conv2d-263          [-1, 256, 22, 22]       1,769,728
     BatchNorm2d-264          [-1, 256, 22, 22]             512
             FAM-265          [-1, 256, 22, 22]               0
          Conv2d-266          [-1, 256, 44, 44]         737,536
     BatchNorm2d-267          [-1, 256, 44, 44]             512
          Conv2d-268          [-1, 256, 22, 22]         590,080
     BatchNorm2d-269          [-1, 256, 22, 22]             512
          Conv2d-270          [-1, 256, 11, 11]         590,080
     BatchNorm2d-271          [-1, 256, 11, 11]             512
          Conv2d-272          [-1, 256, 22, 22]         590,080
          Conv2d-273          [-1, 256, 44, 44]         590,080
          Conv2d-274          [-1, 256, 11, 11]         590,080
          Conv2d-275          [-1, 256, 44, 44]       1,769,728
     BatchNorm2d-276          [-1, 256, 44, 44]             512
             FAM-277          [-1, 256, 44, 44]               0
          Conv2d-278          [-1, 256, 88, 88]         295,168
     BatchNorm2d-279          [-1, 256, 88, 88]             512
          Conv2d-280          [-1, 256, 44, 44]         590,080
     BatchNorm2d-281          [-1, 256, 44, 44]             512
          Conv2d-282          [-1, 256, 11, 11]         590,080
     BatchNorm2d-283          [-1, 256, 11, 11]             512
          Conv2d-284          [-1, 256, 44, 44]         590,080
          Conv2d-285          [-1, 256, 88, 88]         590,080
          Conv2d-286          [-1, 256, 11, 11]         590,080
          Conv2d-287          [-1, 256, 88, 88]       1,769,728
     BatchNorm2d-288          [-1, 256, 88, 88]             512
             FAM-289          [-1, 256, 88, 88]               0
          Conv2d-290            [-1, 1, 11, 11]           2,305
          Conv2d-291            [-1, 1, 22, 22]           2,305
          Conv2d-292            [-1, 1, 44, 44]           2,305
          Conv2d-293            [-1, 1, 88, 88]           2,305
================================================================
Total params: 43,178,432
Trainable params: 43,178,432
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.42
Forward/backward pass size (MB): 45247715344788.27
Params size (MB): 164.71
Estimated Total Size (MB): 45247715344954.39
----------------------------------------------------------------
